In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
s1 = Series(np.random.rand(6),index=[list('111222'),list('abcabc')])
s1

1  a    0.490975
   b    0.697229
   c    0.290844
2  a    0.828472
   b    0.293438
   c    0.157306
dtype: float64

In [3]:
s1['1']

a    0.490975
b    0.697229
c    0.290844
dtype: float64

In [4]:
s1['1','a']

0.49097542744925704

In [5]:
s1[:,'a']

1    0.490975
2    0.828472
dtype: float64

In [6]:
s1

1  a    0.490975
   b    0.697229
   c    0.290844
2  a    0.828472
   b    0.293438
   c    0.157306
dtype: float64

In [7]:
s1.reset_index()

  level_0 level_1         0
0       1       a  0.490975
1       1       b  0.697229
2       1       c  0.290844
3       2       a  0.828472
4       2       b  0.293438
5       2       c  0.157306

## Series转换为DataFrame

In [8]:
s1.unstack()# 二级index转为columns

          a         b         c
1  0.490975  0.697229  0.290844
2  0.828472  0.293438  0.157306

In [9]:
df = DataFrame([s1['1'],s1['2']])
df

          a         b         c
0  0.490975  0.697229  0.290844
1  0.828472  0.293438  0.157306

In [10]:
s2 = df.unstack()# columns转为一级index
s2

a  0    0.490975
   1    0.828472
b  0    0.697229
   1    0.293438
c  0    0.290844
   1    0.157306
dtype: float64

In [11]:
df.T.unstack()

0  a    0.490975
   b    0.697229
   c    0.290844
1  a    0.828472
   b    0.293438
   c    0.157306
dtype: float64

# DataFrame

In [12]:
df1 = DataFrame(np.arange(16).reshape(4,4),index=[list('aabb'),list('1212')],columns=[['BJ','BJ','SH','SH'],[8,9,8,8]])
df1

     BJ      SH
      8   9   8   8
a 1   0   1   2   3
  2   4   5   6   7
b 1   8   9  10  11
  2  12  13  14  15

In [13]:
df1['BJ'][8]

a  1     0
   2     4
b  1     8
   2    12
Name: 8, dtype: int32

In [14]:
df1['BJ'][8].unstack()

   1   2
a  0   4
b  8  12